In [123]:
import pandas as pd
import numpy as np
from sklearn import linear_model
import math
from word2number import w2n
import matplotlib.pyplot as plt
%matplotlib inline

In [97]:
df = pd.read_csv("hiring.csv")

In [98]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [99]:
df.experience = df.experience.fillna("zero")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [100]:
df.experience = df.experience.apply(w2n.word_to_num)

In [101]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [102]:
mean = math.floor(df['interview_score(out of 10)'].mean())

In [103]:
df['interview_score(out of 10)'].fillna(mean)

0     9
1     6
2     7
3    10
4     6
5    10
6     7
7     8
Name: interview_score(out of 10), dtype: int64

In [112]:
mean1 = math.floor(df['test_score(out of 10)'].mean())

In [117]:
df['test_score(out of 10)']=df['test_score(out of 10)'].fillna(mean1)

In [118]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [114]:
model = LinearRegression()

In [119]:
model.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df['salary($)'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [120]:
model.coef_

array([2922.26901502, 2221.30909959, 2147.48256637])

In [121]:
model.intercept_

14992.651446693133

In [122]:
model.predict([[2,9,6]])

array([53713.86677124])